<?php
// 16, 図形の表示
//  0
//  00
//  000
// この図形をfor文を使って出力してください。
echo '【16, 図形の表示】' . "\n";

for($i = 0; $i < 3; $i++) {
    for($j = 0; $j <= $i; $j++) {
        echo "0";
    }
    echo PHP_EOL;
}

// 17, 図形の表示
//    0
//   000
//  00000
echo '【17, 図形の表示】' . "\n";

$h = 3;
for($i = 1; $i <= $h ; $i++) {
    for($j = 1; $j <= ($h - $i); $j++) {
        echo " ";
    }
    for($j = 1; $j <= (($i-1) * 2 +1); $j++) {
        echo "0";
    }
    echo PHP_EOL;
}

// この図形をfor文を使って出力してください。
// 18, 図形の表示
//    0
//   000
//  00000
//   000
//    0
// この図形をfor文を使って出力してください。
echo '【18, 図形の表示】' . "\n";

$h = 5; // 行数
$center = ($h / 2) + 1; // 中間行
for($i = 1; $i <= $center; $i++) {
    for($j = 1; $j <= ($center - $i); $j++) {
        echo " ";
    }
    for($j = 1; $j <= (($i - 1) * 2 + 1); $j++) {
        echo "0";
    }
    echo PHP_EOL;
}
for($i = 1; $i < ($center - 1); $i++){
    for($j = 1; $j < ($i + 1); $j++) {
        echo " ";
    }
    for($j = 1; $j < (($center - $i) * 2 -1); $j++) {
        echo "0";
    }
    echo PHP_EOL;
}
